# Задание 11
# Написать функцию которая получает строку (любую) а затем печатает её 3 раза.
# ls2 = [1, 2, 3]
# y = str(input('Напишите что-нибудь:'))
# for x in ls2:
#     print(y)


# x = int(input('число '))
# print(x, x, x)
# проверено

