# Написать функцию которая получает имя пользователя а потом приветствует его.

# ls2 = [1]
# y = str(input('Напишите своё имя:'))
# for x in ls2:
#     print("Приветствую!!")
# проверено