# 1. Написать функцию которая принимает нефиксированное количество обязательных аргументов и суммирует их.
def ex_1(*a):
    c = 0
    for x in a:
        c = c + x
    return c
# print(ex_1(1, 2, 3, 4, 5))
# проверено


# 2. Пробежать по значениям словаря можно так:
#    d = {'a': 1, 'b': 22}
#    for x in d.values():
#        print(x)
#    --------------------
#    1
#    22
#    Написать функцию которая принимает нефиксированное количество необязательных аргументов и перемножает их.

def ex_2():




    return
print(ex_2())





# 3. Написать функцию которая принимает фиксированное количество обязательных аргументов и нефиксированное количество необязательных аргументов и суммирует их.
#
# 4. Написать функцию которая принимает нефиксированное количество обязательных аргументов и фиксированное количество необязательных аргументов и перемножает их.
#
# 5. Написать функцию которая принимает нефиксированное количество обязательных аргументов и нефиксированное количество необязательных аргументов и суммирует их.

